cmsis-svd/cmsis-svd/data/Nuvoton/NUC126AE_v1.svd
       <register>
          <name>PWM_CAPINEN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PWM_CAPINEN</displayName>
          <description>PWM Capture Input Enable Register</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAPINEN0</name>
              <description>Capture Input Enable Bits\nEach bit n controls the corresponding PWM channel n.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PWM Channel capture input path Disabled. The input of PWM channel capture function is always regarded as 0</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PWM Channel capture input path Enabled. The input of PWM channel capture function comes from correlative multifunction pin</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPINEN1</name>
              <description>Capture Input Enable Bits\nEach bit n controls the corresponding PWM channel n.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PWM Channel capture input path Disabled. The input of PWM channel capture function is always regarded as 0</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PWM Channel capture input path Enabled. The input of PWM channel capture function comes from correlative multifunction pin</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPINEN2</name>
              <description>Capture Input Enable Bits\nEach bit n controls the corresponding PWM channel n.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PWM Channel capture input path Disabled. The input of PWM channel capture function is always regarded as 0</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PWM Channel capture input path Enabled. The input of PWM channel capture function comes from correlative multifunction pin</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPINEN3</name>
              <description>Capture Input Enable Bits\nEach bit n controls the corresponding PWM channel n.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PWM Channel capture input path Disabled. The input of PWM channel capture function is always regarded as 0</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PWM Channel capture input path Enabled. The input of PWM channel capture function comes from correlative multifunction pin</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPINEN4</name>
              <description>Capture Input Enable Bits\nEach bit n controls the corresponding PWM channel n.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PWM Channel capture input path Disabled. The input of PWM channel capture function is always regarded as 0</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PWM Channel capture input path Enabled. The input of PWM channel capture function comes from correlative multifunction pin</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPINEN5</name>
              <description>Capture Input Enable Bits\nEach bit n controls the corresponding PWM channel n.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PWM Channel capture input path Disabled. The input of PWM channel capture function is always regarded as 0</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PWM Channel capture input path Enabled. The input of PWM channel capture function comes from correlative multifunction pin</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
