cmsis-svd/cmsis-svd/data/Nuvoton/NUC126AE_v1.svd
       <register derivedFrom="TIMER0_INTSTS">
          <name>TIMER1_INTSTS</name>
          <displayName>TIMER1_INTSTS</displayName>
          <description>Timer1 Interrupt Status Register</description>
          <addressOffset>0x108</addressOffset>
       </register>
       <register derivedFrom="TIMER0_CNT">
          <name>TIMER1_CNT</name>
          <displayName>TIMER1_CNT</displayName>
          <description>Timer1 Data Register</description>
          <addressOffset>0x10C</addressOffset>
       </register>
       <register derivedFrom="TIMER0_CAP">
          <name>TIMER1_CAP</name>
          <displayName>TIMER1_CAP</displayName>
          <description>Timer1 Capture Data Register</description>
          <addressOffset>0x110</addressOffset>
       </register>
       <register derivedFrom="TIMER0_EXTCTL">
          <name>TIMER1_EXTCTL</name>
          <displayName>TIMER1_EXTCTL</displayName>
          <description>Timer1 External Control Register</description>
          <addressOffset>0x114</addressOffset>
       </register>
       <register derivedFrom="TIMER0_EINTSTS">
          <name>TIMER1_EINTSTS</name>
          <displayName>TIMER1_EINTSTS</displayName>
          <description>Timer1 External Interrupt Status Register</description>
          <addressOffset>0x118</addressOffset>
       </register>
       <register derivedFrom="TIMER0_TRGCTL">
          <name>TIMER1_TRGCTL</name>
          <displayName>TIMER1_TRGCTL</displayName>
          <description>Timer1 Trigger Control Register</description>
          <addressOffset>0x11C</addressOffset>
       </register>
       <register derivedFrom="TIMER0_ALTCTL">
          <name>TIMER1_ALTCTL</name>
          <displayName>TIMER1_ALTCTL</displayName>
          <description>Timer1 Alternative Control Register</description>
          <addressOffset>0x120</addressOffset>
       </register>
       <register derivedFrom="TIMER0_PWMCTL">
          <name>TIMER1_PWMCTL</name>
          <displayName>TIMER1_PWMCTL</displayName>
          <description>Timer1 PWM Control Register</description>
          <addressOffset>0x140</addressOffset>
       </register>
       <register derivedFrom="TIMER0_PWMCLKSRC">
          <name>TIMER1_PWMCLKSRC</name>
          <displayName>TIMER1_PWMCLKSRC</displayName>
          <description>Timer1 PWM Counter Clock Source Register</description>
          <addressOffset>0x144</addressOffset>
       </register>
       <register derivedFrom="TIMER0_PWMCLKPSC">
          <name>TIMER1_PWMCLKPSC</name>
          <displayName>TIMER1_PWMCLKPSC</displayName>
          <description>Timer1 PWM Counter Clock Pre-scale Register</description>
          <addressOffset>0x148</addressOffset>
       </register>
       <register derivedFrom="TIMER0_PWMCNTCLR">
          <name>TIMER1_PWMCNTCLR</name>
          <displayName>TIMER1_PWMCNTCLR</displayName>
          <description>Timer1 PWM Clear Counter Register</description>
          <addressOffset>0x14C</addressOffset>
       </register>
       <register derivedFrom="TIMER0_PWMPERIOD">
          <name>TIMER1_PWMPERIOD</name>
          <displayName>TIMER1_PWMPERIOD</displayName>
          <description>Timer1 PWM Period Register</description>
          <addressOffset>0x150</addressOffset>
       </register>
       <register derivedFrom="TIMER0_PWMCMPDAT">
          <name>TIMER1_PWMCMPDAT</name>
          <displayName>TIMER1_PWMCMPDAT</displayName>
          <description>Timer1 PWM Comparator Register</description>
          <addressOffset>0x154</addressOffset>
       </register>
       <register derivedFrom="TIMER0_PWMDTCTL">
          <name>TIMER1_PWMDTCTL</name>
          <displayName>TIMER1_PWMDTCTL</displayName>
          <description>Timer1 PWM Dead-time Control Register</description>
          <addressOffset>0x158</addressOffset>
       </register>
       <register derivedFrom="TIMER0_PWMCNT">
          <name>TIMER1_PWMCNT</name>
          <displayName>TIMER1_PWMCNT</displayName>
          <description>Timer1 PWM Counter Register</description>
          <addressOffset>0x15C</addressOffset>
       </register>
       <register derivedFrom="TIMER0_PWMMSKEN">
          <name>TIMER1_PWMMSKEN</name>
          <displayName>TIMER1_PWMMSKEN</displayName>
          <description>Timer1 PWM Output Mask Enable Register</description>
          <addressOffset>0x160</addressOffset>
       </register>
       <register derivedFrom="TIMER0_PWMMSK">
          <name>TIMER1_PWMMSK</name>
          <displayName>TIMER1_PWMMSK</displayName>
          <description>Timer1 PWM Output Mask Data Control Register</description>
          <addressOffset>0x164</addressOffset>
       </register>
       <register derivedFrom="TIMER0_PWMBNF">
          <name>TIMER1_PWMBNF</name>
          <displayName>TIMER1_PWMBNF</displayName>
          <description>Timer1 PWM Brake Pin Noise Filter Register</description>
          <addressOffset>0x168</addressOffset>
       </register>
       <register derivedFrom="TIMER0_PWMFAILBRK">
          <name>TIMER1_PWMFAILBRK</name>
          <displayName>TIMER1_PWMFAILBRK</displayName>
          <description>Timer1 PWM System Fail Brake Control Register</description>
          <addressOffset>0x16C</addressOffset>
       </register>
       <register derivedFrom="TIMER0_PWMBRKCTL">
          <name>TIMER1_PWMBRKCTL</name>
          <displayName>TIMER1_PWMBRKCTL</displayName>
          <description>Timer1 PWM Brake Control Register</description>
          <addressOffset>0x170</addressOffset>
       </register>
       <register derivedFrom="TIMER0_PWMPOLCTL">
          <name>TIMER1_PWMPOLCTL</name>
          <displayName>TIMER1_PWMPOLCTL</displayName>
          <description>Timer1 PWM Pin Output Polar Control Register</description>
          <addressOffset>0x174</addressOffset>
       </register>
       <register derivedFrom="TIMER0_PWMPOEN">
          <name>TIMER1_PWMPOEN</name>
          <displayName>TIMER1_PWMPOEN</displayName>
          <description>Timer1 PWM Pin Output Enable Register</description>
          <addressOffset>0x178</addressOffset>
       </register>
