cmsis-svd/cmsis-svd/data/Nuvoton/NUC126AE_v1.svd
       <register derivedFrom="TIMER2_CNT">
          <name>TIMER3_CNT</name>
          <displayName>TIMER3_CNT</displayName>
          <description>Timer3 Data Register</description>
          <addressOffset>0x10C</addressOffset>
       </register>
       <register derivedFrom="TIMER2_CAP">
          <name>TIMER3_CAP</name>
          <displayName>TIMER3_CAP</displayName>
          <description>Timer3 Capture Data Register</description>
          <addressOffset>0x110</addressOffset>
       </register>
       <register derivedFrom="TIMER2_EXTCTL">
          <name>TIMER3_EXTCTL</name>
          <displayName>TIMER3_EXTCTL</displayName>
          <description>Timer3 External Control Register</description>
          <addressOffset>0x114</addressOffset>
       </register>
       <register derivedFrom="TIMER2_EINTSTS">
          <name>TIMER3_EINTSTS</name>
          <displayName>TIMER3_EINTSTS</displayName>
          <description>Timer3 External Interrupt Status Register</description>
          <addressOffset>0x118</addressOffset>
       </register>
       <register derivedFrom="TIMER2_TRGCTL">
          <name>TIMER3_TRGCTL</name>
          <displayName>TIMER3_TRGCTL</displayName>
          <description>Timer3 Trigger Control Register</description>
          <addressOffset>0x11C</addressOffset>
       </register>
       <register derivedFrom="TIMER2_ALTCTL">
          <name>TIMER3_ALTCTL</name>
          <displayName>TIMER3_ALTCTL</displayName>
          <description>Timer3 Alternative Control Register</description>
          <addressOffset>0x120</addressOffset>
       </register>
       <register derivedFrom="TIMER2_PWMCTL">
          <name>TIMER3_PWMCTL</name>
          <displayName>TIMER3_PWMCTL</displayName>
          <description>Timer3 PWM Control Register</description>
          <addressOffset>0x140</addressOffset>
       </register>
       <register derivedFrom="TIMER2_PWMCLKSRC">
          <name>TIMER3_PWMCLKSRC</name>
          <displayName>TIMER3_PWMCLKSRC</displayName>
          <description>Timer3 PWM Counter Clock Source Register</description>
          <addressOffset>0x144</addressOffset>
       </register>
       <register derivedFrom="TIMER2_PWMCLKPSC">
          <name>TIMER3_PWMCLKPSC</name>
          <displayName>TIMER3_PWMCLKPSC</displayName>
          <description>Timer3 PWM Counter Clock Pre-scale Register</description>
          <addressOffset>0x148</addressOffset>
       </register>
       <register derivedFrom="TIMER2_PWMCNTCLR">
          <name>TIMER3_PWMCNTCLR</name>
          <displayName>TIMER3_PWMCNTCLR</displayName>
          <description>Timer3 PWM Clear Counter Register</description>
          <addressOffset>0x14C</addressOffset>
       </register>
       <register derivedFrom="TIMER2_PWMPERIOD">
          <name>TIMER3_PWMPERIOD</name>
          <displayName>TIMER3_PWMPERIOD</displayName>
          <description>Timer3 PWM Period Register</description>
          <addressOffset>0x150</addressOffset>
       </register>
       <register derivedFrom="TIMER2_PWMCMPDAT">
          <name>TIMER3_PWMCMPDAT</name>
          <displayName>TIMER3_PWMCMPDAT</displayName>
          <description>Timer3 PWM Comparator Register</description>
          <addressOffset>0x154</addressOffset>
       </register>
       <register derivedFrom="TIMER2_PWMDTCTL">
          <name>TIMER3_PWMDTCTL</name>
          <displayName>TIMER3_PWMDTCTL</displayName>
          <description>Timer3 PWM Dead-time Control Register</description>
          <addressOffset>0x158</addressOffset>
       </register>
       <register derivedFrom="TIMER2_PWMCNT">
          <name>TIMER3_PWMCNT</name>
          <displayName>TIMER3_PWMCNT</displayName>
          <description>Timer3 PWM Counter Register</description>
          <addressOffset>0x15C</addressOffset>
       </register>
       <register derivedFrom="TIMER2_PWMMSKEN">
          <name>TIMER3_PWMMSKEN</name>
          <displayName>TIMER3_PWMMSKEN</displayName>
          <description>Timer3 PWM Output Mask Enable Register</description>
          <addressOffset>0x160</addressOffset>
       </register>
       <register derivedFrom="TIMER2_PWMMSK">
          <name>TIMER3_PWMMSK</name>
          <displayName>TIMER3_PWMMSK</displayName>
          <description>Timer3 PWM Output Mask Data Control Register</description>
          <addressOffset>0x164</addressOffset>
       </register>
       <register derivedFrom="TIMER2_PWMBNF">
          <name>TIMER3_PWMBNF</name>
          <displayName>TIMER3_PWMBNF</displayName>
          <description>Timer3 PWM Brake Pin Noise Filter Register</description>
          <addressOffset>0x168</addressOffset>
       </register>
       <register derivedFrom="TIMER2_PWMFAILBRK">
          <name>TIMER3_PWMFAILBRK</name>
          <displayName>TIMER3_PWMFAILBRK</displayName>
          <description>Timer3 PWM System Fail Brake Control Register</description>
          <addressOffset>0x16C</addressOffset>
       </register>
       <register derivedFrom="TIMER2_PWMBRKCTL">
          <name>TIMER3_PWMBRKCTL</name>
          <displayName>TIMER3_PWMBRKCTL</displayName>
          <description>Timer3 PWM Brake Control Register</description>
          <addressOffset>0x170</addressOffset>
       </register>
       <register derivedFrom="TIMER2_PWMPOLCTL">
          <name>TIMER3_PWMPOLCTL</name>
          <displayName>TIMER3_PWMPOLCTL</displayName>
          <description>Timer3 PWM Pin Output Polar Control Register</description>
          <addressOffset>0x174</addressOffset>
       </register>
       <register derivedFrom="TIMER2_PWMPOEN">
          <name>TIMER3_PWMPOEN</name>
          <displayName>TIMER3_PWMPOEN</displayName>
          <description>Timer3 PWM Pin Output Enable Register</description>
          <addressOffset>0x178</addressOffset>
       </register>
       <register derivedFrom="TIMER2_PWMSWBRK">
          <name>TIMER3_PWMSWBRK</name>
          <displayName>TIMER3_PWMSWBRK</displayName>
          <description>Timer3 PWM Software Trigger Brake Control Register</description>
          <addressOffset>0x17C</addressOffset>
       </register>
       <register derivedFrom="TIMER2_PWMINTEN0">
          <name>TIMER3_PWMINTEN0</name>
          <displayName>TIMER3_PWMINTEN0</displayName>
          <description>Timer3 PWM Interrupt Enable Register 0</description>
          <addressOffset>0x180</addressOffset>
       </register>
       <register derivedFrom="TIMER2_PWMINTEN1">
          <name>TIMER3_PWMINTEN1</name>
          <displayName>TIMER3_PWMINTEN1</displayName>
          <description>Timer3 PWM Interrupt Enable Register 1</description>
          <addressOffset>0x184</addressOffset>
       </register>
       <register derivedFrom="TIMER2_PWMINTSTS0">
          <name>TIMER3_PWMINTSTS0</name>
          <displayName>TIMER3_PWMINTSTS0</displayName>
          <description>Timer3 PWM Interrupt Status Register 0</description>
          <addressOffset>0x188</addressOffset>
       </register>
       <register derivedFrom="TIMER2_PWMINTSTS1">
          <name>TIMER3_PWMINTSTS1</name>
          <displayName>TIMER3_PWMINTSTS1</displayName>
          <description>Timer3 PWM Interrupt Status Register 1</description>
          <addressOffset>0x18C</addressOffset>
       </register>
       <register derivedFrom="TIMER2_PWMADCTS">
          <name>TIMER3_PWMADCTS</name>
          <displayName>TIMER3_PWMADCTS</displayName>
          <description>Timer3 PWM ADC Trigger Source Select Register</description>
          <addressOffset>0x190</addressOffset>
       </register>
       <register derivedFrom="TIMER2_PWMSCTL">
          <name>TIMER3_PWMSCTL</name>
          <displayName>TIMER3_PWMSCTL</displayName>
          <description>Timer3 PWM Synchronous Control Register</description>
          <addressOffset>0x194</addressOffset>
       </register>
       <register derivedFrom="TIMER2_PWMSTATUS">
          <name>TIMER3_PWMSTATUS</name>
          <displayName>TIMER3_PWMSTATUS</displayName>
          <description>Timer3 PWM Status Register</description>
          <addressOffset>0x19C</addressOffset>
       </register>
       <register derivedFrom="TIMER2_PWMPBUF">
          <name>TIMER3_PWMPBUF</name>
          <displayName>TIMER3_PWMPBUF</displayName>
          <description>Timer3 PWM Period Buffer Register</description>
          <addressOffset>0x1A0</addressOffset>
       </register>
       <register derivedFrom="TIMER2_PWMCMPBUF">
          <name>TIMER3_PWMCMPBUF</name>
          <displayName>TIMER3_PWMCMPBUF</displayName>
          <description>Timer3 PWM Comparator Buffer Register</description>
          <addressOffset>0x1A4</addressOffset>
       </register>
